In [98]:
import sqlite3
import pandas as pd
from pathlib import Path

In [99]:
parent_dir = Path().resolve()

conn = sqlite3.connect(f'{parent_dir}/STAFF.db')
table_name = 'INSTRUCTOR'
attribute_list = ['ID', 'FNAME', 'LNAME', 'CITY', 'CCODE']

In [100]:
file_path = f'{parent_dir}/data/INSTRUCTOR.csv'
df = pd.read_csv(file_path, names=attribute_list)

In [101]:
df.to_sql(table_name, conn, if_exists='replace', index=False)

14

In [102]:
query_statement = f'SELECT * FROM {table_name}'
query_output = pd.read_sql(query_statement, conn)

In [103]:
query_statement

'SELECT * FROM INSTRUCTOR'

In [104]:
query_output

    ID    FNAME      LNAME      CITY CCODE
0    1      Rav      Ahuja   TORONTO    CA
1    2     Raul      Chong   Markham    CA
2    3     Hima  Vasudevan   Chicago    US
3    4     John     Thomas  Illinois    US
4    5    Alice      James  Illinois    US
5    6    Steve      Wells  Illinois    US
6    7  Santosh      Kumar  Illinois    US
7    8    Ahmed    Hussain  Illinois    US
8    9    Nancy      Allen  Illinois    US
9   10     Mary     Thomas  Illinois    US
10  11  Bharath      Gupta  Illinois    US
11  12   Andrea      Jones  Illinois    US
12  13      Ann      Jacob  Illinois    US
13  14     Amit      Kumar  NewDelhi    IN

In [105]:
query_statement = f'SELECT FNAME FROM {table_name}'
query_output = pd.read_sql(query_statement, conn)

query_output

      FNAME
0       Rav
1      Raul
2      Hima
3      John
4     Alice
5     Steve
6   Santosh
7     Ahmed
8     Nancy
9      Mary
10  Bharath
11   Andrea
12      Ann
13     Amit

In [106]:
query_statement = f'SELECT COUNT(*) FROM {table_name}'
query_output = pd.read_sql(query_statement, conn)

query_output

   COUNT(*)
0        14

In [107]:
data_dict = {'ID': [100],
             'FNAME': ['John'],
             'LNAME': ['Doe'],
             'CITY': ['Paris'],
             'CCODE': ['FR']}
data_append = pd.DataFrame(data_dict)

In [108]:
data_append.to_sql(table_name, conn, if_exists='append', index=False)
print('Data appended successfully.')

Data appended successfully.

In [109]:
query_statement = f'SELECT COUNT(*) FROM {table_name}'
query_output = pd.read_sql(query_statement, conn)

query_output

   COUNT(*)
0        15

In [110]:
conn.close()